---
title: PipePressureDropData
classe: Autodesk.Revit.DB.Plumbing.PipePressureDropData
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 21
---

# PipePressureDropData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CategoryId { get; }` | `pipePressureDropData.CategoryId` | ElementId |
| `Double Coefficient { get; set; }` | `pipePressureDropData.Coefficient` | Double |
| `Double Density { get; }` | `pipePressureDropData.Density` | Double |
| `Double Flow { get; }` | `pipePressureDropData.Flow` | Double |
| `PipeFlowState FlowState { get; set; }` | `pipePressureDropData.FlowState` | PipeFlowState |
| `Double Friction { get; set; }` | `pipePressureDropData.Friction` | Double |
| `Double FrictionFactor { get; set; }` | `pipePressureDropData.FrictionFactor` | Double |
| `Double InsideDiameter { get; }` | `pipePressureDropData.InsideDiameter` | Double |
| `Boolean IsValidObject { get; }` | `pipePressureDropData.IsValidObject` | Boolean |
| `SystemCalculationLevel KLevel { get; }` | `pipePressureDropData.KLevel` | SystemCalculationLevel |
| `Double Length { get; }` | `pipePressureDropData.Length` | Double |
| `Double NominalDiameter { get; }` | `pipePressureDropData.NominalDiameter` | Double |
| `Double OutsideDiameter { get; }` | `pipePressureDropData.OutsideDiameter` | Double |
| `Double PressureDrop { get; set; }` | `pipePressureDropData.PressureDrop` | Double |
| `Double RelativeRoughness { get; set; }` | `pipePressureDropData.RelativeRoughness` | Double |
| `Double ReynoldsNumber { get; set; }` | `pipePressureDropData.ReynoldsNumber` | Double |
| `Double Roughness { get; }` | `pipePressureDropData.Roughness` | Double |
| `Double Velocity { get; set; }` | `pipePressureDropData.Velocity` | Double |
| `Double VelocityPressure { get; set; }` | `pipePressureDropData.VelocityPressure` | Double |
| `Double Viscosity { get; }` | `pipePressureDropData.Viscosity` | Double |
| `Void Dispose()` | `pipePressureDropData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```